In [27]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame([['jan',10,30],['feb',15,31],['march',16,30],['april',25,33]]
                    ,index=[0,1,2,3]
                    ,columns=['month','avg_min_temp','avg_max_temp'])

In [3]:
data

   month  avg_min_temp  avg_max_temp
0    jan            10            30
1    feb            15            31
2  march            16            30
3  april            25            33

In [4]:
data.dtypes

month           object
avg_min_temp     int64
avg_max_temp     int64
dtype: object

In [5]:
data.columns

Index(['month', 'avg_min_temp', 'avg_max_temp'], dtype='object')

In [6]:
data.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [7]:
data.describe()

       avg_min_temp  avg_max_temp
count      4.000000      4.000000
mean      16.500000     31.000000
std        6.244998      1.414214
min       10.000000     30.000000
25%       13.750000     30.000000
50%       15.500000     30.500000
75%       18.250000     31.500000
max       25.000000     33.000000

In [8]:
data.sort_values(by=['avg_max_temp'])

   month  avg_min_temp  avg_max_temp
0    jan            10            30
2  march            16            30
1    feb            15            31
3  april            25            33

In [10]:
data['month']

0      jan
1      feb
2    march
3    april
Name: month, dtype: object

In [14]:
data.iloc[[1, 2]]

   month  avg_min_temp  avg_max_temp
1    feb            15            31
2  march            16            30

In [16]:
data[{'month','avg_min_temp'}]

/tmp/ipykernel_10419/1455878081.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  data[{'month','avg_min_temp'}]

   month  avg_min_temp
0    jan            10
1    feb            15
2  march            16
3  april            25

In [21]:
data[1:3]

   month  avg_min_temp  avg_max_temp
1    feb            15            31
2  march            16            30

In [22]:
data['avg_min_temp'] > 15

0    False
1    False
2     True
3     True
Name: avg_min_temp, dtype: bool

In [23]:
data[data['avg_min_temp'] > 15]

   month  avg_min_temp  avg_max_temp
2  march            16            30
3  april            25            33

In [29]:
data['new_col'] = np.nan
data

   month  avg_min_temp  avg_max_temp  new_col
0    jan            10            30      NaN
1    feb            15            31      NaN
2  march            16            30      NaN
3  april            25            33      NaN

In [30]:
data.isna()

   month  avg_min_temp  avg_max_temp  new_col
0  False         False         False     True
1  False         False         False     True
2  False         False         False     True
3  False         False         False     True

In [32]:
data.rename(columns = {'month':'MONTH',}, inplace = True)
data

   MONTH  avg_min_temp  avg_max_temp  new_col
0    jan            10            30      NaN
1    feb            15            31      NaN
2  march            16            30      NaN
3  april            25            33      NaN